{"backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "return_sequences": true, "units": 512, "implementation": 1, "unit_forget_bias": true, "unroll": false, "stateful": false, "batch_input_shape": [null, 20, 32], "use_bias": true, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "return_state": false, "kernel_constraint": null, "name": "lstm_1", "bias_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "return_sequences": true, "units": 512, "unit_forget_bias": true, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "return_state": false, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "implementation": 1, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "lstm_2", "bias_regularizer": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "return_sequences": false, "units": 512, "unit_forget_bias": true, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "return_state": false, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "implementation": 1, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "lstm_3", "bias_regularizer": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activation": "softmax", "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.2", "class_name": "Sequential"}